Revit 2024 API
SATImportOptions Constructor
 Constructs a new instance of SATImportOptions with default values of all properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public SATImportOptions()
Visual Basic
Public Sub New
Visual C++
public:
SATImportOptions()
See Also
SATImportOptions Class
SATImportOptions Overload
Autodesk.Revit.DB Namespace